tobiasjaster/nuttx/arch/arm/src/stm32l4/stm32l4_ioexpander.c
/****************************************************************************
 * arch/arm/src/stm32l4/stm32l4_ioexpander.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/kmalloc.h>
#include <nuttx/semaphore.h>
#include <nuttx/ioexpander/ioexpander.h>
#include <nuttx/ioexpander/gpio.h>
#include <arch/board/board.h>
#include "../../common/arm_internal.h"
#include "./stm32l4_ioexpander.h"
#include "./stm32l4_gpio.h"

#if defined(CONFIG_IOEXPANDER_STM32L4_EXPANDER)

#ifndef CONFIG_IOEXPANDER_INT_ENABLE
#error GPIO Interrupts must be handled by STM32L4 GPIO Expander
#endif /* !CONFIG_IOEXPANDER_INT_ENABLE */

#ifndef CONFIG_GPIO_LOWER_HALF
#error GPIO Lower Half is required by STM32L4 GPIO Expander
#endif /* !CONFIG_GPIO_LOWER_HALF */

#ifdef CONFIG_STM32L4_EXPANDER_MULTIPLE
#error Multiple STM32L4 GPIO Expanders are not supported
#endif /* CONFIG_STM32L4_EXPANDER_MULTIPLE */

#ifdef CONFIG_IOEXPANDER_MULTIPIN
#error Multipin STM32L4 GPIO Expander is not supported
#endif /* CONFIG_IOEXPANDER_MULTIPIN */

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

#ifdef CONFIG_IOEXPANDER_INT_ENABLE
/* Callback for a registered pin interrupt */

struct stm32l4_expander_callback_s
{
  ioe_pinset_t pinset;   /* Set of pins that will trigger the interrupt callback */
  ioe_callback_t cbfunc; /* Callback function */
  FAR void* cbarg;       /* Callback argument */
};
#endif

/* I/O Expander Driver State */

struct stm32l4_expander_dev_s
{
  struct ioexpander_dev_s dev;  /* Nested structure to allow casting as public gpio expander */
  sem_t exclsem;                /* Mutual exclusion */

#ifdef CONFIG_IOEXPANDER_INT_ENABLE
  struct work_s work;           /* Supports the interrupt handling "bottom half" */

  /* Saved callback information for each I/O expander client */

  struct stm32l4_expander_callback_s cb[CONFIG_STM32L4_IOEXPANDER_NPINS];
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int stm32l4_expander_lock(FAR struct stm32l4_expander_dev_s *priv);

static int stm32l4_expander_direction(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                          int dir);
static int stm32l4_expander_option(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                       int opt, void *val);
static int stm32l4_expander_writepin(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                         bool value);
static int stm32l4_expander_readpin(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                        FAR bool *value);
static int stm32l4_expander_readbuf(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                        FAR bool *value);
#ifdef CONFIG_IOEXPANDER_MULTIPIN
static int stm32l4_expander_multiwritepin(FAR struct ioexpander_dev_s *dev,
                              FAR uint8_t *pins, FAR bool *values,
                              int count);
static int stm32l4_expander_multireadpin(FAR struct ioexpander_dev_s *dev,
                             FAR uint8_t *pins, FAR bool *values, int count);
static int stm32l4_expander_multireadbuf(FAR struct ioexpander_dev_s *dev,
                             FAR uint8_t *pins, FAR bool *values, int count);
#endif
#ifdef CONFIG_IOEXPANDER_INT_ENABLE
static FAR void *stm32l4_expander_attach(FAR struct ioexpander_dev_s *dev,
                       ioe_pinset_t pinset,
                       ioe_callback_t callback, FAR void *arg);
static int stm32l4_expander_detach(FAR struct ioexpander_dev_s *dev,
                       FAR void *handle);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct stm32l4_expander_dev_s g_stm32l4_expander_dev;

/* I/O Expander Operations */

static const struct ioexpander_ops_s g_stm32l4_expander_ops =
{
  stm32l4_expander_direction,
  stm32l4_expander_option,
  stm32l4_expander_writepin,
  stm32l4_expander_readpin,
  stm32l4_expander_readbuf
#ifdef CONFIG_IOEXPANDER_MULTIPIN
  , stm32l4_expander_multiwritepin
  , stm32l4_expander_multireadpin
  , stm32l4_expander_multireadbuf
#endif
#ifdef CONFIG_IOEXPANDER_INT_ENABLE
  , stm32l4_expander_attach
  , stm32l4_expander_detach
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32l4_expander_interrupt
 *
 * Description:
 *   Handle GPIO Interrupt.
 *
 ****************************************************************************/

