tobiasjaster/nuttx/arch/arm/src/stm32l4/stm32l4_ioexpander.c
static int stm32l4_expander_interrupt(int irq, void *context, void *arg)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)arg;
  uint32_t time_out = 0;
  unsigned int gpio_pin;

  gpioinfo("Interrupt! context=%p, priv=%p\n", context, priv);
  DEBUGASSERT(priv != NULL);

  gpio_pin = (unsigned int)*arg;

  FAR struct stm32l4_expander_callback_s *cb = &priv->cb[gpio_pin];
  ioe_callback_t cbfunc = cb->cbfunc;
  FAR void* cbarg = cb->cbarg;

  /* NOTE: Callback will run in the context of Interrupt Handler */

  if (cbfunc == NULL)
    {
      gpioinfo("Missing callback for GPIO %d\n", gpio_pin);
    }
  else
    {
      gpioinfo("Call gpio=%d, callback=%p, arg=%p\n", gpio_pin, cbfunc, cbarg);
      cbfunc(&priv->dev, gpio_pin, cbarg);
    }
  }

  return OK;
}

/****************************************************************************
 * Name: stm32l4_expander_lock
 *
 * Description:
 *   Get exclusive access to the I/O Expander
 *
 ****************************************************************************/

static int stm32l4_expander_lock(FAR struct stm32l4_expander_dev_s *priv)
{
  return nxsem_wait_uninterruptible(&priv->exclsem);
}

#define stm32l4_expander_unlock(p) nxsem_post(&(p)->exclsem)

/****************************************************************************
 * Name: stm32l4_expander_direction
 *
 * Description:
 *   Set the direction of an ioexpander pin. Required.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   pin - The index of the pin to alter in this call
 *   dir - One of the IOEXPANDER_DIRECTION_ macros
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

static int stm32l4_expander_direction(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                          int direction)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret;
  uintptr_t base;
  unsigned int stm32_port;
  unsigned int stm32_pin;

  if (direction != IOEXPANDER_DIRECTION_IN &&
      direction != IOEXPANDER_DIRECTION_IN_PULLUP &&
      direction != IOEXPANDER_DIRECTION_IN_PULLDOWN &&
      direction != IOEXPANDER_DIRECTION_OUT && 
      direction != IOEXPANDER_DIRECTION_OUT_OPENDRAIN)
    {
      return -EINVAL;
    }

  DEBUGASSERT(priv != NULL && pin < CONFIG_STM32L4_IOEXPANDER_NPINS);

  /* Get exclusive access to the I/O Expander */

  ret = stm32l4_expander_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  unsigned int pinmode;
  uint32_t pupd = GPIO_PUPDR_NONE;
  bool od = false;
  switch (direction)
    {
      case IOEXPANDER_DIRECTION_IN:
        pinmode = GPIO_MODER_INPUT;
        break;
      case IOEXPANDER_DIRECTION_IN_PULLUP:
        pinmode = GPIO_MODER_INPUT;
        pupd = GPIO_PUPDR_PULLUP;
        break;
      case IOEXPANDER_DIRECTION_IN_PULLDOWN:
        pinmode = GPIO_MODER_INPUT;
        pupd = GPIO_PUPDR_PULLDOWN;
        break;
      case IOEXPANDER_DIRECTION_OUT:
        pinmode = GPIO_MODER_OUTPUT;
        break;
      case IOEXPANDER_DIRECTION_OUT_OPENDRAIN:
        pinmode = GPIO_MODER_OUTPUT;
        od = true;
        break;
      default:
        break;
    }
  stm32l4_gpio_set_pinmode(stm32_port, stm32_pin, pinmode);

  if (pupd != GPIO_PUPDR_NONE)
    {
        stm32l4_gpio_set_pupd(stm32_port, stm32_pin, pupd);
    }
  if (od)
    {
        stm32l4_gpio_set_od(stm32_port, stm32_pin, true);
    }

  stm32l4_expander_unlock(priv);
  return ret;
}

/****************************************************************************
 * Name: stm32l4_expander_option
 *
 * Description:
 *   Set pin options. Required.
 *   Since all IO expanders have various pin options, this API allows setting
 *     pin options in a flexible way.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   pin - The index of the pin to alter in this call
 *   opt - One of the IOEXPANDER_OPTION_ macros
 *   val - The option's value
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

static int stm32l4_expander_option(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                       int opt, FAR void *value)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret = -ENOSYS;
  unsigned int stm32_port;
  unsigned int stm32_pin;
  uint32_t exti;

  gpioinfo("pin=%u, option=%u, value=%p\n", pin, opt, value);

  DEBUGASSERT(priv != NULL);

  /* Get exclusive access to the I/O Expander */
  stm32_pin = pin%16;
  stm32_port = (pin-stm32_pin)/16;
  exti = STM32L4_EXTI1_BIT(stm32_pin);

  ret = stm32l4_expander_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Handle each option */

  switch(opt)
    {
      case IOEXPANDER_OPTION_INTCFG: /* Interrupt Trigger */
        {
          switch((uint32_t)value)
            {
              case IOEXPANDER_VAL_RISING: /* Rising Edge */
                {
                  gpioinfo("Rising edge: pin=%u\n", pin);
                  modifyreg32(STM32L4_EXTI1_RTSR, 0, exti);
                  modifyreg32(STM32L4_EXTI1_FTSR, exti, 0);
                  stm32l4_gpio_exti(stm32_port, stm32_pin, true);
                  break;
                }

              case IOEXPANDER_VAL_FALLING: /* Falling Edge */
                {
                  gpioinfo("Falling edge: pin=%u\n", pin);
                  modifyreg32(STM32L4_EXTI1_RTSR, exti, 0);
                  modifyreg32(STM32L4_EXTI1_FTSR, 0, exti);
                  stm32l4_gpio_exti(stm32_port, stm32_pin, true);
                  break;
                }

              case IOEXPANDER_VAL_BOTH: /* Both Edge (Unimplemented) */
                {
                  modifyreg32(STM32L4_EXTI1_RTSR, 0, exti);
                  modifyreg32(STM32L4_EXTI1_FTSR, 0, exti);
                  stm32l4_gpio_exti(stm32_port, stm32_pin, true);
                  break;
                }

              case IOEXPANDER_VAL_DISABLE: /* Disable (Unimplemented) */
                {
                  modifyreg32(STM32L4_EXTI1_RTSR, exti, 0);
                  modifyreg32(STM32L4_EXTI1_FTSR, exti, 0);
                  stm32l4_gpio_exti(stm32_port, stm32_pin, false);
                  break;
                }

              default: /* Unsupported Interrupt */
                {
                  gpioerr("ERROR: Unsupported interrupt: %d, pin=%u\n", value, pin);
                  ret = -EINVAL;
                  break;
                }
            }
          break;
        }

      default: /* Unsupported Option */
        {
          gpioerr("ERROR: Unsupported option: %d, pin=%u\n", opt, pin);
          ret = -ENOSYS;
        }
    }

  /* Unlock the I/O Expander */

  stm32l4_expander_unlock(priv);
  return ret;
}

/****************************************************************************
 * Name: stm32l4_expander_writepin
 *
 * Description:
 *   Set the pin level. Required.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   pin - The index of the pin to alter in this call
 *   val - The pin level. Usually TRUE will set the pin high,
 *         except if OPTION_INVERT has been set on this pin.
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

