tobiasjaster/nuttx/arch/arm/src/stm32l4/stm32l4_ioexpander.c
static int stm32l4_expander_writepin(FAR struct ioexpander_dev_s *dev,
                                   uint8_t pin,
                                   bool value)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret;
  unsigned int stm32_port;
  unsigned int stm32_pin;
  uint32_t pinset;

  gpioinfo("pin=%u, value=%u\n", pin, value);

  DEBUGASSERT(priv != NULL && pin < CONFIG_STM32L4_IOEXPANDER_NPINS);

  /* Get exclusive access to the I/O Expander */
  stm32_pin = pin%16;
  stm32_port = (pin-stm32_pin)/16;
  pinset |= (stm32_port << GPIO_PORT_SHIFT);
  pinset |= (stm32_pin << GPIO_PIN_SHIFT);
  ret = stm32l4_expander_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Write the pin value. Warning: Pin Number passed as STM32L4 Pinset */

  stm32l4_gpiowrite(pinset, value);

  /* Unlock the I/O Expander */

  stm32l4_expander_unlock(priv);
  return ret;
}

/****************************************************************************
 * Name: stm32l4_expander_readpin
 *
 * Description:
 *   Read the actual PIN level. This can be different from the last value
 *   written to this pin. Required.
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   pin    - The index of the pin
 *   valptr - Pointer to a buffer where the pin level is stored. Usually TRUE
 *            if the pin is high, except if OPTION_INVERT has been set on
 *            this pin.
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

static int stm32l4_expander_readpin(FAR struct ioexpander_dev_s *dev, 
                                  uint8_t pin,
                                  FAR bool *value)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret;
  unsigned int stm32_port;
  unsigned int stm32_pin;
  uint32_t pinset;

  DEBUGASSERT(priv != NULL && pin < CONFIG_STM32L4_IOEXPANDER_NPINS &&
              value != NULL);

  /* Get exclusive access to the I/O Expander */
  stm32_pin = pin%16;
  stm32_port = (pin-stm32_pin)/16;
  pinset |= (stm32_port << GPIO_PORT_SHIFT);
  pinset |= (stm32_pin << GPIO_PIN_SHIFT);
  ret = stm32l4_expander_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Read the pin value. Warning: Pin Number passed as STM32L4 Pinset */

  *value = stm32l4_gpioread(pinset);

  /* Unlock the I/O Expander */

  stm32l4_expander_unlock(priv);
  gpioinfo("pin=%u, value=%u\n", pin, *value);
  return ret;
}

/****************************************************************************
 * Name: stm32l4_expander_readbuf
 *
 * Description:
 *   Read the buffered pin level.
 *   This can be different from the actual pin state. Required.
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   pin    - The index of the pin
 *   valptr - Pointer to a buffer where the level is stored.
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

static int stm32l4_expander_readbuf(FAR struct ioexpander_dev_s *dev, 
                                  uint8_t pin,
                                  FAR bool *value)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret;
  unsigned int stm32_port;
  unsigned int stm32_pin;
  uint32_t pinset;

  gpioerr("ERROR: Not supported\n");
  DEBUGPANIC();

  stm32_pin = pin%16;
  stm32_port = (pin-stm32_pin)/16;
  pinset |= (stm32_port << GPIO_PORT_SHIFT);
  pinset |= (stm32_pin << GPIO_PIN_SHIFT);
  /* Get exclusive access to the I/O Expander */

  ret = stm32l4_expander_lock(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* TODO: Read the buffered pin level */

  /* Unlock the I/O Expander */

  stm32l4_expander_unlock(priv);
  return ret;
}

/****************************************************************************
 * Name: stm32l4_expander_multiwritepin
 *
 * Description:
 *   Set the pin level for multiple pins. This routine may be faster than
 *   individual pin accesses. Optional.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   pins - The list of pin indexes to alter in this call
 *   val - The list of pin levels.
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

#ifdef CONFIG_IOEXPANDER_MULTIPIN
static int stm32l4_expander_multiwritepin(FAR struct ioexpander_dev_s *dev,
                              FAR uint8_t *pins, FAR bool *values, int count)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret;

  gpioinfo("count=%u\n", count);

  DEBUGASSERT(priv != NULL && pins != NULL && values != NULL && count > 0);

  /* Get exclusive access to the I/O Expander */
  if (ret < 0)
    {
      return ret;
    }

  for (int i=0; i<count; i++)
    {
        ret = stm32l4_expander_writepin(priv, pins[i], values[i]);
        if (ret < 0)
          {
            return ret;
          }
    }
  return OK;
}
#endif

/****************************************************************************
 * Name: stm32l4_expander_multireadpin
 *
 * Description:
 *   Read the actual level for multiple pins. This routine may be faster than
 *   individual pin accesses. Optional.
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   pin    - The list of pin indexes to read
 *   valptr - Pointer to a buffer where the pin levels are stored.
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

#ifdef CONFIG_IOEXPANDER_MULTIPIN
static int stm32l4_expander_multireadpin(FAR struct ioexpander_dev_s *dev,
                             FAR uint8_t *pins, FAR bool *values, int count)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret;

