tobiasjaster/nuttx/arch/arm/src/stm32l4/stm32l4_ioexpander.c
  gpioinfo("count=%u\n", count);

  DEBUGASSERT(priv != NULL && pins != NULL && values != NULL && count > 0);

  if (ret < 0)
    {
      return ret;
    }

  
  for (int i=0; i<count; i++)
    {
        ret = stm32l4_expander_readpin(priv, pins[i], &values[i]);
        if (ret < 0)
          {
            return ret;
          }
    }
  return ret;
}
#endif

/****************************************************************************
 * Name: stm32l4_expander_multireadbuf
 *
 * Description:
 *   Read the buffered level of multiple pins. This routine may be faster
 *   than individual pin accesses. Optional.
 *
 * Input Parameters:
 *   dev    - Device-specific state data
 *   pin    - The index of the pin
 *   valptr - Pointer to a buffer where the buffered levels are stored.
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

#ifdef CONFIG_IOEXPANDER_MULTIPIN
static int stm32l4_expander_multireadbuf(FAR struct ioexpander_dev_s *dev,
                             FAR uint8_t *pins, FAR bool *values, int count)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  int ret;

  gpioinfo("count=%u\n", count);

  DEBUGASSERT(priv != NULL && pins != NULL && values != NULL && count > 0);

  if (ret < 0)
    {
      return ret;
    }

  for (int i=0;i<count;i++)
    {
      ret = stm32l4_expander_readbuf(priv, pins[i], &values[i]);
      if (ret < 0)
        {
          return ret;
        }
    }
  return ret;
}
#endif

/****************************************************************************
 * Name: stm32l4_expander_attach
 *
 * Description:
 *   Attach a pin interrupt callback function.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   pinset   - The set of pin events that will generate the callback
 *   callback - The pointer to callback function.  NULL will detach the
 *              callback. NOTE: Callback will run in the context of
 *              Interrupt Handler.
 *   arg      - Argument that will be provided to the callback function
 *
 * Returned Value:
 *   Callback Handle on success, else NULL
 *
 ****************************************************************************/

#ifdef CONFIG_IOEXPANDER_INT_ENABLE
static FAR void *stm32l4_expander_attach(FAR struct ioexpander_dev_s *dev,
                       ioe_pinset_t pinset,
                       ioe_callback_t callback, FAR void *arg)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  FAR struct stm32l4_expander_callback_s *cb = NULL;
  int ret = 0;
  unsigned int stm32_pin;

  gpioinfo("pinset=0x%lx, callback=%p, arg=%p\n", pinset, callback, arg);
  DEBUGASSERT(priv != NULL);

  /* Get exclusive access to the I/O Expander */

  ret = stm32l4_expander_lock(priv);
  if (ret < 0)
    {
      gpioerr("ERROR: Lock failed\n");
      return NULL;
    }

  /* Handle each GPIO Pin in the pinset */
#if CONFIG_STM32L4_IOEXPANDER_NPINS <= 64

  for (uint8_t gpio_pin = 0; gpio_pin < CONFIG_STM32L4_IOEXPANDER_NPINS; gpio_pin++)
    {
      /* If GPIO Pin is set in the pinset... */

      if (pinset & ((ioe_pinset_t)1 << gpio_pin))
        {
          cb = &priv->cb[gpio_pin];

          if (callback == NULL) /* Detach Callback */
            {
              /* Disable GPIO Interrupt and clear Interrupt Callback */

              gpioinfo("Detach callback for gpio=%lu, callback=%p, arg=%p\n",
                      cb->pinset, cb->cbfunc, cb->cbarg);
              
              stm32_pin = gpio_pin%16;
              stm32l4_exti_gpio_set_irq(stm32_pin, false);
              modifyreg32(STM32L4_EXTI1_EMR,
                        STM32L4_EXTI1_BIT(stm32_pin), 0);
              modifyreg32(STM32L4_EXTI1_IMR,
                        STM32L4_EXTI1_BIT(stm32_pin), 0);
              g_gpio_handlers[stm32_pin].callback = NULL;
              kmm_free(g_gpio_handlers[stm32_pin].arg);
              g_gpio_handlers[stm32_pin].arg = NULL;
              cb->pinset = 0;
              cb->cbfunc = NULL;
              cb->cbarg  = NULL;
              ret = 0;
            }
          else if (cb->cbfunc == NULL) /* Attach Callback */
            {
              /* Set Interrupt Callback and enable GPIO Interrupt */

              gpioinfo("Attach callback for gpio=%d, callback=%p, arg=%p\n", 
                      gpio_pin, callback, arg);

              stm32_pin = gpio_pin%16;
              modifyreg32(STM32L4_EXTI1_EMR,
                        0, STM32L4_EXTI1_BIT(stm32_pin));
              modifyreg32(STM32L4_EXTI1_IMR,
                        0, STM32L4_EXTI1_BIT(stm32_pin));
              g_gpio_handlers[stm32_pin].callback = stm32l4_expander_interrupt;
              unsigned int *arg_int = (unsigned int *)kmm_zalloc(sizeof(unsigned int));
              memcpy(arg_int, &stm32_pin, sizeof(unsigned int));
              g_gpio_handlers[stm32_pin].arg      = arg_int;
              cb->pinset = gpio_pin;
              cb->cbfunc = callback;
              cb->cbarg  = arg;
              ret = 0;
            }
          else /* Callback already attached */
            {
              gpioerr("ERROR: GPIO %d already attached\n", gpio_pin);
              ret = -EBUSY;
            }

          /* Only 1 GPIO Pin allowed */

          DEBUGASSERT(pinset == ((ioe_pinset_t)1 << gpio_pin));
          break;
        }
    }
#else
    gpio_pin = (uint8_t)pinset;
    cb = &priv->cb[gpio_pin];

    if (callback == NULL) /* Detach Callback */
    {
        /* Disable GPIO Interrupt and clear Interrupt Callback */

        gpioinfo("Detach callback for gpio=%lu, callback=%p, arg=%p\n",
                cb->pinset, cb->cbfunc, cb->cbarg);
        
        stm32_pin = gpio_pin%16;
        stm32l4_exti_gpio_set_irq(stm32_pin, false);
        modifyreg32(STM32L4_EXTI1_EMR,
                STM32L4_EXTI1_BIT(stm32_pin), 0);
        modifyreg32(STM32L4_EXTI1_IMR,
                STM32L4_EXTI1_BIT(stm32_pin), 0);
        g_gpio_handlers[stm32_pin].callback = NULL;
        kmm_free(g_gpio_handlers[stm32_pin].arg);
        g_gpio_handlers[stm32_pin].arg = NULL;
        cb->pinset = 0;
        cb->cbfunc = NULL;
        cb->cbarg  = NULL;
        ret = 0;
    }
    else if (cb->cbfunc == NULL) /* Attach Callback */
    {
        /* Set Interrupt Callback and enable GPIO Interrupt */

