tobiasjaster/nuttx/arch/arm/src/stm32l4/stm32l4_ioexpander.c
        gpioinfo("Attach callback for gpio=%d, callback=%p, arg=%p\n", 
                gpio_pin, callback, arg);

        stm32_pin = gpio_pin%16;
        modifyreg32(STM32L4_EXTI1_EMR,
                0, STM32L4_EXTI1_BIT(stm32_pin));
        modifyreg32(STM32L4_EXTI1_IMR,
                0, STM32L4_EXTI1_BIT(stm32_pin));
        g_gpio_handlers[stm32_pin].callback = stm32l4_expander_interrupt;
        unsigned int *arg_int = (unsigned int *)kmm_zalloc(sizeof(unsigned int));
        memcpy(arg_int, &stm32_pin, sizeof(unsigned int));
        g_gpio_handlers[stm32_pin].arg      = arg_int;
        cb->pinset = gpio_pin;
        cb->cbfunc = callback;
        cb->cbarg  = arg;
        ret = 0;
    }
    else /* Callback already attached */
    {
        gpioerr("ERROR: GPIO %d already attached\n", gpio_pin);
        ret = -EBUSY;
    }
#endif // CONFIG_STM32L4_IOEXPANDER_NPINS
  /* Unlock the I/O Expander and return the handle */

  stm32l4_expander_unlock(priv);
  return (ret == 0) ? cb : NULL;
}
#endif

/****************************************************************************
 * Name: stm32l4_expander_detach
 *
 * Description:
 *   Detach and disable a pin interrupt callback function.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   handle   - The non-NULL opaque value return by stm32l4_expander_attach()
 *
 * Returned Value:
 *   0 on success, else a negative error code
 *
 ****************************************************************************/

#ifdef CONFIG_IOEXPANDER_INT_ENABLE
static int stm32l4_expander_detach(FAR struct ioexpander_dev_s *dev, FAR void *handle)
{
  FAR struct stm32l4_expander_dev_s *priv = (FAR struct stm32l4_expander_dev_s *)dev;
  FAR struct stm32l4_expander_callback_s *cb =
    (FAR struct stm32l4_expander_callback_s *)handle;
  unsigned int stm32_pin;

  DEBUGASSERT(priv != NULL && cb != NULL);
  DEBUGASSERT((uintptr_t)cb >= (uintptr_t)&priv->cb[0] &&
              (uintptr_t)cb <=
              (uintptr_t)&priv->cb[CONFIG_STM32L4_IOEXPANDER_NPINS - 1]);
  UNUSED(priv);
  gpioinfo("Detach callback for gpio=%lu, callback=%p, arg=%p\n",
           cb->pinset, cb->cbfunc, cb->cbarg);

  /* Disable the GPIO Interrupt */

#if CONFIG_STM32L4_IOEXPANDER_NPINS <= 64
  for (uint8_t gpio_pin = 0; gpio_pin < CONFIG_STM32L4_IOEXPANDER_NPINS; gpio_pin++)
    {
      if (cb->pinset & ((ioe_pinset_t)1 << gpio_pin))
        {
            stm32_pin = gpio_pin%16;
            stm32l4_exti_gpio_set_irq(stm32_pin, false);
            modifyreg32(STM32L4_EXTI1_EMR,
                    STM32L4_EXTI1_BIT(stm32_pin), 0);
            modifyreg32(STM32L4_EXTI1_IMR,
                    STM32L4_EXTI1_BIT(stm32_pin), 0);
            g_gpio_handlers[stm32_pin].callback = NULL;
            kmm_free(g_gpio_handlers[stm32_pin].arg);
            g_gpio_handlers[stm32_pin].arg = NULL;
        }
    }
#else
    stm32_pin = cb->pinset%16;
    stm32l4_exti_gpio_set_irq(stm32_pin, false);
    modifyreg32(STM32L4_EXTI1_EMR,
            STM32L4_EXTI1_BIT(stm32_pin), 0);
    modifyreg32(STM32L4_EXTI1_IMR,
            STM32L4_EXTI1_BIT(stm32_pin), 0);
    g_gpio_handlers[stm32_pin].callback = NULL;
    kmm_free(g_gpio_handlers[stm32_pin].arg);
    g_gpio_handlers[stm32_pin].arg = NULL;
#endif

  DEBUGASSERT(cb->pinset < CONFIG_STM32L4_IOEXPANDER_NPINS);

  /* Clear the Interrupt Callback */
  cb->pinset = 0;
  cb->cbfunc = NULL;
  cb->cbarg  = NULL;
  return OK;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32l4_expander_initialize
 *
 * Description:
 *   Initialize a I/O Expander device.
 *
 ****************************************************************************/

FAR struct ioexpander_dev_s *stm32l4_expander_initialize(
  const uint32_t *gpios,
  uint8_t gpio_count)
{
  int i;
  int ret;
  uint8_t pin;
  bool gpio_is_used[CONFIG_STM32L4_IOEXPANDER_NPINS];
  FAR struct stm32l4_expander_dev_s *priv;

  DEBUGASSERT(gpio_count <= CONFIG_STM32L4_IOEXPANDER_NPINS);

  /* Use the one-and-only I/O Expander driver instance */
  priv = &g_stm32l4_expander_dev;

  /* Initialize the device state structure */

  priv->dev.ops = &g_stm32l4_expander_ops;
  nxsem_init(&priv->exclsem, 0, 1);

  /* Mark the GPIOs in use */

  memset(gpio_is_used, 0, sizeof(gpio_is_used));

  /* Configure and register the GPIO Inputs */

  for (i = 0; i < gpio_count; i++)
    {
      uint32_t cfgset = gpios[i];
      uint8_t gpio_pin = ((cfgset & GPIO_PIN_MASK) >> GPIO_PIN_SHIFT) + ((cfgset & GPIO_PORT_MASK) >> GPIO_PORT_SHIFT)*16;
      DEBUGASSERT(gpio_pin < CONFIG_STM32L4_IOEXPANDER_NPINS);
      if (gpio_is_used[gpio_pin])
        {
          gpioerr("ERROR: GPIO pin %d is already in use\n", gpio_pin);
          return NULL;
        }
      gpio_is_used[gpio_pin] = true;

      ret = stm32l4_configgpio(cfgset & (GPIO_PIN_MASK | GPIO_PORT_MASK));
      DEBUGASSERT(ret == OK);
      // gpio_lower_half(&priv->dev, gpio_pin, GPIO_INPUT_PIN, gpio_pin);
    }
  return &priv->dev;
}

#endif /* CONFIG_IOEXPANDER_STM32L4_EXPANDER */